<a href="https://colab.research.google.com/github/MyDearGreatTeacher/AI4high/blob/master/pandas%E5%B0%88%E9%A1%8C_%E7%B0%A1%E5%96%AE%E8%82%A1%E7%A5%A8%E6%9F%A5%E8%A9%A2%E5%88%86%E6%9E%90.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandas專題

https://colab.research.google.com/drive/1D_a3idela6AvAMOm4AxigfoecY1YlQvm#scrollTo=Xsm9YrtKT2Aw

In [0]:
!pip install pyquery

In [4]:
from pyquery import PyQuery as pq

def get_top_100():
  stock_url = "https://tw.stock.yahoo.com/d/i/rank.php?t=pri&e=tse&n=100"
  ticker_name_css = ".name a"
  price_css = ".name+ td"
  
  html_doc = pq(stock_url)
  tickers = [tn.text.split()[0] for tn in html_doc(ticker_name_css)]
  names = [tn.text.split()[1] for tn in html_doc(ticker_name_css)]
  #ticker_name = [tn.text for tn in html_doc(ticker_name_css)]
  prices = [float(p.text) for p in html_doc(price_css)]
  return tickers, names, prices

Collecting pyquery
  Downloading https://files.pythonhosted.org/packages/09/c7/ce8c9c37ab8ff8337faad3335c088d60bed4a35a4bed33a64f0e64fbcf29/pyquery-1.4.0-py2.py3-none-any.whl
Requirement already satisfied: lxml>=2.1 in /usr/local/lib/python3.6/dist-packages (from pyquery) (4.2.6)
Collecting cssselect>0.7.9 (from pyquery)
  Downloading https://files.pythonhosted.org/packages/7b/44/25b7283e50585f0b4156960691d951b05d061abf4a714078393e51929b30/cssselect-1.0.3-py2.py3-none-any.whl
Installing collected packages: cssselect, pyquery
Successfully installed cssselect-1.0.3 pyquery-1.4.0

In [0]:
get_top_100()

In [10]:
tickers, names, prices = get_top_100()
#tickers
#names
# prices
tickers[0], names[0], prices[0]

('3008', '大立光', 4695.0)

In [0]:
# Create DataFrame - 1
import pandas as pd

df = pd.DataFrame()
df["ticker"] = tickers
df["name"] = names
df["price"] = prices

df.head()
#df

In [13]:
# Create DataFrame - 2
stock_dict = {
    "ticker": tickers,
    "name": names,
    "price": prices
}
df = pd.DataFrame(stock_dict, columns = ["ticker", "name", "price"])
df.head()

  ticker   name   price
0   3008    大立光  4695.0
1   6409     旭隼   610.0
2   5269     祥碩   539.0
3   6415  矽力-KY   495.0
4   1476     儒鴻   441.0

In [14]:
# filter: 觀測值篩選
df[df["price"] > 1000]

  ticker name   price
0   3008  大立光  4695.0

In [0]:
# filter: 設立在境外的公司篩選出來
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.str.contains.html
df[df["name"].str.contains("KY")]

In [21]:
# .loc OR .iloc
ky_df = df[df["name"].str.contains("KY")]
ky_df

#ky_df.loc[[2, 7, 13, 16, 17], ["name", "price"]]
# 找不到key會出錯

ky_df.loc[[3, 6, 21], ["name", "price"]]

      name  price
3    矽力-KY  495.0
6   亞德客-KY  437.0
21   麗豐-KY  255.0

In [22]:
ky_df.iloc[:5, [1, 2]]

      name  price
3    矽力-KY  495.0
6   亞德客-KY  437.0
21   麗豐-KY  255.0
29   康友-KY  222.5
35   貿聯-KY  199.5

In [23]:
# mutate: 新增變數
has_ky = df["name"].str.contains("KY")
df["listed_in_cayman"] = has_ky
df.head()

  ticker   name   price  listed_in_cayman
0   3008    大立光  4695.0             False
1   6409     旭隼   610.0             False
2   5269     祥碩   539.0             False
3   6415  矽力-KY   495.0              True
4   1476     儒鴻   441.0             False

In [24]:
# arrange：排序資料框
# arrange by index
df.sort_index(ascending=False).head()

   ticker   name  price  listed_in_cayman
99   2383    台光電  100.0             False
98   4190  佐登-KY  100.5              True
97   3504    揚明光  100.5             False
96   2456    奇力新  102.5             False
95   6176     瑞儀  103.0             False

In [25]:
df.sort_values("listed_in_cayman").head()

   ticker name   price  listed_in_cayman
0    3008  大立光  4695.0             False
68   2345   智邦   128.5             False
67   6552  易華電   130.0             False
66   8016   矽創   132.5             False
64   4536   拓凱   135.0             False

In [26]:
df.sort_values(["listed_in_cayman", "price"],
              ascending=[True, False]).head()

  ticker name   price  listed_in_cayman
0   3008  大立光  4695.0             False
1   6409   旭隼   610.0             False
2   5269   祥碩   539.0             False
4   1476   儒鴻   441.0             False
5   3563   牧德   438.0             False

In [28]:
df["price"].max()
df["price"].min()
df[df["price"] == df["price"].max()]
df["price"].idxmax()
df.loc[df["price"].idxmax(), :]
df.loc[df["price"].idxmin(), :]
# summarize
df["price"].median()
# groupby
df[df["listed_in_cayman"]]["price"].median() # KY
df[~df["listed_in_cayman"]]["price"].median() # non-KY
grouped = df.groupby("listed_in_cayman")
grouped["price"].median()
grouped["ticker"].count()
# filter
df[df["price"] > 500]
# groupby
df["listed_in_kayman"] = df["name"].str.contains("KY")
df.head()

  ticker   name   price  listed_in_cayman  listed_in_kayman
0   3008    大立光  4695.0             False             False
1   6409     旭隼   610.0             False             False
2   5269     祥碩   539.0             False             False
3   6415  矽力-KY   495.0              True              True
4   1476     儒鴻   441.0             False             False

In [0]:
grouped = df.groupby("listed_in_kayman")
#print(grouped)
print(type(grouped.count()))
print(type(grouped["ticker"].count()))